Repository: SofyKov/AppDevFinal
Catalog: AppDev-Final-Project/EarthPage/EarthPage/EarthPage/Form1.*.resx
Languages: es_mx, fr_ca, pt_pt

# generalButton.Text
source: General Information
es_mx: Información general
fr_ca: Informations générales
pt_pt: Informações gerais

# issuesButton.Text
source: Global Issues
es_mx: Asuntos globales
fr_ca: Problèmes mondiaux
pt_pt: Assuntos globais

# solutionButton.Text
source: Solutions
es_mx: Soluciones
pt_pt: Soluções

# languageLabel.Text
source: Language
es_mx: Idioma
fr_ca: Langue
pt_pt: Linguagem

# languageComboBox.Items3
source: Portugese
pt_pt: Portuguese

# generalInfoLabel.Text
source: General info
es_mx: Información general
fr_ca: Informations générales
pt_pt: Informações gerais

# generalInfoTextBox.Text
source: Position in Solar System: Third planet from the Sun Distance from Sun: Approximately 93 million miles (150 million kilometers) Orbital Period: Approximately 365.25 days (one Earth year) Rotation Period: Approximately 24 hours (one Earth day) Equatorial Diameter: Approximately 12,742 kilometers (7,918 miles) Surface Area: Approximately 510 million square kilometers (197 million square miles) Composition: Mostly rock and iron with a thin outer layer of soil and water Atmosphere: Composed mainly of nitrogen (78%) and oxygen (21%) with traces of other gases Population: Approximately 7.9 billion people (as of 2022) Biodiversity: Home to millions of species of plants, animals, and microorganisms
es_mx: Posición en el Sistema Solar: Tercer planeta desde el Sol Distancia al Sol: Aproximadamente 93 millones de millas (150 millones de kilómetros) Período orbital: aproximadamente 365,25 días (un año terrestre) Período de rotación: aproximadamente 24 horas (un día terrestre) Diámetro ecuatorial: Aproximadamente 12.742 kilómetros (7.918 millas) Área de superficie: Aproximadamente 510 millones de kilómetros cuadrados (197 millones de millas cuadradas) Composición: Mayormente roca y hierro con una fina capa exterior de suelo y agua. Atmósfera: Compuesta principalmente de nitrógeno (78%) y oxígeno (21%) con trazas de otros gases. Población: Aproximadamente 7,9 mil millones de personas (a partir de 2022) Biodiversidad: hogar de millones de especies de plantas, animales y microorganismos
fr_ca: Position dans le système solaire : troisième planète à partir du Soleil Distance du Soleil : Environ 93 millions de miles (150 millions de kilomètres) Période orbitale : environ 365,25 jours (une année terrestre) Période de rotation : environ 24 heures (un jour terrestre) Diamètre équatorial : environ 12 742 kilomètres (7 918 miles) Superficie : Environ 510 millions de kilomètres carrés (197 millions de miles carrés) Composition : Principalement de la roche et du fer avec une fine couche externe de terre et d'eau Atmosphère : Composée principalement d'azote (78 %) et d'oxygène (21 %) avec des traces d'autres gaz Population : environ 7,9 milliards de personnes (en 2022) Biodiversité : abrite des millions d’espèces de plantes, d’animaux et de micro-organismes
pt_pt: Posição no Sistema Solar: Terceiro planeta a partir do Sol Distância do Sol: Aproximadamente 93 milhões de milhas (150 milhões de quilômetros) Período Orbital: Aproximadamente 365,25 dias (um ano terrestre) Período de rotação: Aproximadamente 24 horas (um dia terrestre) Diâmetro Equatorial: Aproximadamente 12.742 quilômetros (7.918 milhas) Área de Superfície: Aproximadamente 510 milhões de quilômetros quadrados (197 milhões de milhas quadradas) Composição: Principalmente rocha e ferro com uma fina camada externa de solo e água Atmosfera: Composta principalmente por nitrogênio (78%) e oxigênio (21%) com vestígios de outros gases População: Aproximadamente 7,9 bilhões de pessoas (em 2022) Biodiversidade: lar de milhões de espécies de plantas, animais e microorganismos

# instructionLabel.Text
source: (TYPE EXACTLY AS IT IS)
es_mx: (ESCRIBA EXACTAMENTE COMO ES)
fr_ca: (TAPER EXACTEMENT TEL QUEL)
pt_pt: (digite exatamente como está)

# getInfoButton.Text
source: get info
es_mx: conseguir información
fr_ca: obtient info
pt_pt: obter informação

# issuesRichTextxBox.Text
source: CLIMATE CHANGE BIODIVERSITY LOSS WATER SCARCITY DEFORESTATION POLLUTION
es_mx: CAMBIO CLIMÁTICO PÉRDIDA DE BIODIVERSIDAD ESCASEZ DE AGUA DEFORESTACIÓN CONTAMINACIÓN
fr_ca: CHANGEMENT CLIMATIQUE PERTE DE BIODIVERSITÉ LA PÉNURIE D'EAU LA DÉFORESTATION POLLUTION
pt_pt: DAS ALTERAÇÕES CLIMÁTICAS BIODIVERSITY LOSS WATER SCARCITY DEFORESTATION POLLUTION

# searchLabel.Text
source: GLOBAL ISSUE:
es_mx: PROBLEMA GLOBAL:
fr_ca: problème mondial:
pt_pt: QUESTÃO GLOBAL::

# backButton2.Text
source: Back
es_mx: Atrás
fr_ca: RETOUR
pt_pt: voltar

# label5.Text
source: POLLUTION
es_mx: CONTAMINACIÓN
pt_pt: POLUIÇÃO

# label4.Text
source: DEFORESTATION
es_mx: DEFORESTACIÓN
fr_ca: LA DÉFORESTATION
pt_pt: DESMATAMENTO

# label3.Text
source: WATER SCARCITY
es_mx: ESCASEZ DE AGUA
fr_ca: LA PÉNURIE D'EAU
pt_pt: ESCASSEZ DE ÁGUA

# label2.Text
source: BIODIVERSITY LOSS
es_mx: PÉRDIDA DE BIODIVERSIDAD
fr_ca: PERTE DE BIODIVERSITÉ
pt_pt: PERDA DE BIODIVERSIDADE

# pollutionTextBox.Text
source: Adoption of Clean Technologies Improvement of Waste Management Systems Enforcement of Air Quality Regulations Upgrading Water Treatment Facilities Promotion of Sustainable Consumption Patterns
es_mx: Adopción de tecnologías limpias Mejora de los sistemas de gestión de residuos Aplicación de las regulaciones de calidad del aire Actualización de las instalaciones de tratamiento de agua Promoción de patrones de consumo sostenibles
fr_ca: Adoption de technologies propres Amélioration des systèmes de gestion des déchets Application des réglementations sur la qualité de l’air Modernisation des installations de traitement de l'eau Promotion de modes de consommation durables
pt_pt: Adoção de tecnologias limpas Melhoria dos Sistemas de Gestão de Resíduos Aplicação dos regulamentos de qualidade do ar Atualizando Instalações de Tratamento de Água Promoção de padrões de consumo sustentáveis

# defoTextBox.Text
source: Strengthen Forest Protection Efforts Reforestation and Afforestation Projects Sustainable Forest Management Practices Land Use Planning Policies Recognition of Indigenous Land Rights
es_mx: Fortalecer los esfuerzos de protección forestal Proyectos de Reforestación y Forestación Prácticas de manejo forestal sostenible Políticas de planificación del uso del suelo Reconocimiento de los derechos territoriales indígenas
fr_ca: Renforcer les efforts de protection des forêts Projets de reboisement et de boisement Pratiques de gestion durable des forêts Politiques d’aménagement du territoire Reconnaissance des droits fonciers autochtones
pt_pt: Fortalecer os esforços de proteção florestal Projetos de Reflorestamento e Florestação Práticas Sustentáveis de Manejo Florestal Políticas de Planejamento de Uso do Solo Reconhecimento dos direitos às terras indígenas

# label1.Text
source: CLIMATE CHANGE
es_mx: CAMBIO CLIMÁTICO
fr_ca: CHANGEMENT CLIMATIQUE
pt_pt: DAS ALTERAÇÕES CLIMÁTICAS

# watertextBox.Text
source: Water Conservation Measures Sustainable Water Management Investment in Water Infrastructure Rainwater Harvesting Systems Water Governance and Equity Measures
es_mx: Medidas de conservación del agua Gestión Sostenible del Agua Inversión en infraestructura hídrica Sistemas de recolección de agua de lluvia Gobernanza del agua y medidas de equidad
fr_ca: Mesures de conservation de l'eau Gestion durable de l'eau Investissement dans les infrastructures hydrauliques Systèmes de récupération d'eau de pluie Gouvernance de l’eau et mesures d’équité
pt_pt: Medidas de Conservação da Água Gestão Sustentável da Água Investimento em infraestrutura hídrica Sistemas de captação de água da chuva Governança Hídrica e Medidas de Equidade

# bioTextBox.Text
source: Establish Protected Areas Habitat Restoration Projects Sustainable Land Management Practices Combat Illegal Wildlife Trade Public Awareness and Education Campaigns
es_mx: Establecer áreas protegidas Proyectos de restauración de hábitat Prácticas de gestión sostenible de la tierra Combatir el comercio ilegal de vida silvestre Campañas de sensibilización y educación pública
fr_ca: Établir des zones protégées Projets de restauration de l'habitat Pratiques de gestion durable des terres Combattre le commerce illégal d’espèces sauvages Campagnes de sensibilisation et d'éducation du public
pt_pt: Estabelecer Áreas Protegidas Projetos de restauração de habitat Práticas Sustentáveis de Gestão de Terras Combater o comércio ilegal de vida selvagem Campanhas de Conscientização Pública e Educação

# climateChangeTextBox.Text
source: Transition to Renewable Energy Energy Efficiency Measures Afforestation and Reforestation Sustainable Agriculture Practices International Cooperation on Climate Action
es_mx: Transición a energías renovables Medidas de eficiencia energética Forestación y Reforestación Prácticas de agricultura sostenible Cooperación internacional sobre acción climática
fr_ca: Transition vers les énergies renouvelables Mesures d'efficacité énergétique Boisement et reboisement Pratiques agricoles durables Coopération internationale sur l'action climatique
pt_pt: Transição para Energia Renovável Medidas de Eficiência Energética Florestação e Reflorestamento Práticas Agrícolas Sustentáveis Cooperação Internacional em Ação Climática

# backButton3.Text
source: Back
fr_ca: Retour
pt_pt: Voltar

# label6.Text
source: EARTH
es_mx: TIERRA
fr_ca: LA TERRE
pt_pt: TERRA

# backButton.Text
source: Back
es_mx: Atrás
fr_ca: Retour
